app/Controllers/News.php

INSERT INTO `news` (`title`, `slug`, `body`) VALUES ('CI Rocks', 'ci-rocks', 'I am using CodeIgniter 4 to create the app.')
---
    public function create() {
        $dateYear = new \DateTime();
        $model = model(NewsModel::class);
        if ($this->request->getMethod() === 'post' && $this->validate([
                    'title' => 'required|min_length[3]|max_length[255]',
                    'body' => 'required',
                ])) {
            $model->save([
                'title' => $this->request->getPost('title'),
                'slug' => url_title($this->request->getPost('title'), '-', true),
                'body' => $this->request->getPost('body'),
            ]);